Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
names = pd.Series(['daksh', 'dev', 'raghav'])
ages = pd.Series([25, 30, 35])
countries = pd.Series(['india', 'Canada', 'UK'])
df=pd.DataFrame({"Name":names,"Age":ages,"Country":countries})

In [3]:
df

     Name  Age Country
0   daksh   25   india
1     dev   30  Canada
2  raghav   35      UK

In [4]:
df.Age.max()

35

In [5]:
c=df.groupby("Country")

In [6]:
c

In [7]:
c.count()

         Name  Age
Country
Canada      1    1
UK          1    1
india       1    1

In [8]:
df.head()

     Name  Age Country
0   daksh   25   india
1     dev   30  Canada
2  raghav   35      UK

In [9]:
df.iloc[2]

Name       raghav
Age            35
Country        UK
Name: 2, dtype: object

In [10]:
df.loc[0,"Age"]

25

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
import numpy as np
columns=["A","B","C"]
data=np.random.rand(3,3)
index=["daksh","dev","ram"]
df1=pd.DataFrame(data,columns=columns,index=index)

In [12]:
df1

              A         B         C
daksh  0.228100  0.984174  0.190450
dev    0.236691  0.967773  0.889975
ram    0.021095  0.349938  0.380551

In [13]:
def reindex_dataframe(df1):
    df1 = df.reset_index(drop=True)
    new_index = pd.RangeIndex(start=1, stop=len(df1)*2, step=2)
    df1.index = new_index
    
    return df1

In [14]:
reindexed_df = reindex_dataframe(df1)

In [15]:
reindexed_df

     Name  Age Country
1   daksh   25   india
3     dev   30  Canada
5  raghav   35      UK

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [17]:
df=pd.DataFrame({"value":[i for i in range(10,60,10)]})
sum=0
count=0
for i in df.value:
    while(count<=3):
        sum=sum+i
        count=count+i
        break
print(sum)

10

In [18]:
df

   value
0     10
1     20
2     30
3     40
4     50

In [19]:
for i in range(10,60,10):
    print(i)

10
20
30
40
50

In [20]:
df

   value
0     10
1     20
2     30
3     40
4     50

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
df=pd.DataFrame({"text":["radhe","krishna","shiv","shankar"]})

In [22]:
df

      text
0    radhe
1  krishna
2     shiv
3  shankar

In [23]:
def count_words(row):
    words=row["text"].split()
    return len(words)
def add_word_count_column(df):
    df["word_count"]=df.apply(count_words,axis=1)
data = {'text': ["This is a sample text.", "Count the words in this row.", "Another row with some words."]}
df = pd.DataFrame(data)
add_word_count_column(df)
print(df)

                           text  word_count
0        This is a sample text.           5
1  Count the words in this row.           6
2  Another row with some words.           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [24]:
import numpy as np

In [26]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
np.shape(df)

(3, 2)

In [27]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
np.size(df)

6

Q6. Which function of pandas do we use to read an excel file?

df=pd.read_excel("healthcare")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [33]:
def emailid(email):
    username=email.split('@')[0]
    return username

def add_username(df):
    df["username"]=df["email"].apply(emailid)
data= {'email': ['manish.doe@example.com', 'daksh.smith@example.com', 'dev123@example.com']}
df = pd.DataFrame(data)
add_username(df)
print(df)

                     email     username
0   manish.doe@example.com   manish.doe
1  daksh.smith@example.com  daksh.smith
2       dev123@example.com       dev123

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [44]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows
data = {'A': [3,8,6,2,9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)

selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [59]:
def calculate_stats(df):
    mean_value = df['Values'].mean()
    median_value = df['Values'].median()
    std_value = df['Values'].std()

    return mean_value, median_value, std_value
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
mean_val, median_val, std_val = calculate_stats(df)
print("Mean:", mean_val)
print("Median:", median_val)
print("Standard Deviation:", std_val)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [60]:
import pandas as pd

def select_rows_between_dates(df, start_date, end_date):
    df['Date'] = pd.to_datetime(df['Date'])

    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return selected_rows
data = {'Date': ['2023-01-01', '2023-01-15', '2023-02-05', '2023-01-31']}
df = pd.DataFrame(data)
start_date = '2023-01-01'
end_date = '2023-01-31'

selected_df = select_rows_between_dates(df, start_date, end_date)
print(selected_df)

        Date
0 2023-01-01
1 2023-01-15
3 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is the Pandas library itself. Pandas is a popular Python library for data manipulation and analysis, and it provides a wide range of functions and data structures, the most important of which is the DataFrame.

To import Pandas, you typically use the following import statement:

import pandas as pd

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [67]:
def calculate_movingaverage(df):
    df["date"]=pd.to_datetime(df["date"])
    df.sort_values("date",inplace=True)
    df["movingaveage"]=df["sales"].rolling(window=7,min_periods=1).mean()
    return df
data = {
    'date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08'],
    'sales': [10, 20, 15, 25, 30, 35, 40, 45]
}
df = pd.DataFrame(data)
df_cal=calculate_movingaverage(df)
print(df_cal)

        date  sales  movingaveage
0 2023-01-01     10          10.0
1 2023-01-02     20          15.0
2 2023-01-03     15          15.0
3 2023-01-04     25          17.5
4 2023-01-05     30          20.0
5 2023-01-06     35          22.5
6 2023-01-07     40          25.0
7 2023-01-08     45          30.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [74]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = ["monday","tueday","wednesday","friday","saturday"]
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)

add_weekday_column(df)
print(df)

        Date    Weekday
0 2023-01-01     monday
1 2023-01-02     tueday
2 2023-01-03  wednesday
3 2023-01-04     friday
4 2023-01-05   saturday